In [2]:
import pandas as pd
a= pd.read_csv("D:\\Pandas(python library)\\demo.csv")
a

   a   b   c
0  1   8  15
1  2   9  16
2  3  10  17
3  4  11  18
4  5  12  19
5  6  13  20
6  7  14  21

In [4]:
import numpy as np #for getting in form of array in numpy
var1=np.asarray(a)
var1

array([[ 1,  8, 15],
       [ 2,  9, 16],
       [ 3, 10, 17],
       [ 4, 11, 18],
       [ 5, 12, 19],
       [ 6, 13, 20],
       [ 7, 14, 21]])

axis=0 means rows and axis=1 means columns

In [7]:
a.sort_index(axis=0,ascending=False) #sorting the csv files in terms of rows ascending order

   a   b   c
6  7  14  21
5  6  13  20
4  5  12  19
3  4  11  18
2  3  10  17
1  2   9  16
0  1   8  15

for changing the a specific elements

In [12]:
a.loc[0,"b"]=89
print(a)

   a   b   c
0  1  89  15
1  2   9  16
2  3  10  17
3  4  11  18
4  5  12  19
5  6  13  20
6  7  14  21

for getting a specific data elements

In [15]:
a.loc[[2,3],["a","b"]]

   a   b
2  3  10
3  4  11

In [17]:
a.loc[:,["a","b"]]

   a   b
0  1  89
1  2   9
2  3  10
3  4  11
4  5  12
5  6  13
6  7  14

for deleting a row or a columns

In [19]:
a.drop("b",axis=1)

   a   c
0  1  15
1  2  16
2  3  17
3  4  18
4  5  19
5  6  20
6  7  21

In [21]:
a.drop(0,axis=0)

   a   b   c
1  2   9  16
2  3  10  17
3  4  11  18
4  5  12  19
5  6  13  20
6  7  14  21